{
  "id": "advanced-template-helpers",
  "class": "blog_post",
  "title": "Power User Guide to Template Helpers",
  "slug": "advanced-template-helpers",
  "description": "Mastering built-in helpers for complex template logic",
  "aspects": {
    "blog_post": {
      "date": "2025-12-06",
      "content": "Struktur includes dozens of template helpers beyond the basics. If you only use `{{#each}}` and `{{#if}}`, you're missing out on serious power.\n\n**Filtering and querying:** `where` filters arrays by property value. `where_includes` checks if an array field contains a value—this is how tag pages work. `where_includes_any` and `where_includes_all` handle multiple conditions. These turn templates into query engines. No need for separate data processing steps.\n\n**Sorting and transformation:** `sort_by` orders arrays by a field. Chain it with filters: `{{sort_by (where_includes instances 'tags' 'tutorial') 'date'}}` gives you tutorial posts in date order. `reverse` flips arrays. `uniq` removes duplicates. These are the building blocks for complex layouts.\n\n**String manipulation:** `slugify` converts text to URL-safe strings. `replace` does find-and-replace. `split` breaks strings into arrays. `uppercase`, `lowercase`, `capitalize`, `title_case` format text. These save you from pre-processing data or writing custom helpers.\n\n**Custom helpers in Skribe:** `gather_tags` extracts all unique tags from blog posts. `posts_with_tag` filters posts by tag. These power the tag taxonomy. `render_file` renders a partial as a separate output file—this is how we generate 16 post pages from one layout template.\n\nThe real power is **composition**. Helpers are pure functions that you can nest and chain. Filter, then sort, then transform. This keeps templates declarative instead of imperative. You describe what you want, not how to compute it. Master these helpers and you can build anything: blogs, documentation sites, API references, multi-language sites with localization mixins. The template layer becomes a full-featured query and rendering engine.",
      "tags": [
        "advanced",
        "tutorial"
      ]
    }
  }
}
