{
  "id": "composable-classes",
  "class": "blog_post",
  "title": "Building Composable Class Hierarchies",
  "slug": "composable-classes",
  "description": "Design patterns for flexible, reusable classes",
  "aspects": {
    "blog_post": {
      "date": "2025-12-12",
      "content": "The best class hierarchies are shallow and composable. Deep inheritance trees become maintenance nightmares. Here's how to design classes that stay manageable.\n\n**Start with a minimal base.** Skribe's content_base defines only what ALL content needs: id, title, slug, description. Nothing blog-specific, nothing page-specific. Just the universal interface. This is the foundation that everything else builds on.\n\n**Layer specific types.** blog_post extends content_base and adds date, author, tags. page extends content_base and adds menu. Each child adds its specific concerns without polluting the base. This keeps classes focused and understandable.\n\n**Use composition for cross-cutting concerns.** Instead of featured_blog_post extending blog_post, create a featured_mixin that any content can layer in. Instead of seo_blog_post, create an seo_mixin. Let instances compose behaviors: this post is both featured AND has SEO metadata. Composition is more flexible than inheritance.\n\n**Avoid deep chains.** More than 3 levels of inheritance gets confusing. You lose track of where fields come from. Schema compatibility checks get complex. Performance degrades. Keep it shallow: base → type → maybe one specialization. That's it.\n\n**Prefer multiple narrow classes over one wide class.** Don't create a monolithic content class with every possible field and a type discriminator. Create focused classes: blog_post, page, tutorial, case_study. Each has only the fields it needs. This makes schemas clearer and validation more precise.\n\n**Composition over inheritance.** Even in a system built on inheritance, composition wins. Use inheritance for type hierarchies (blog_post IS-A content). Use mixins and instance overrides for behaviors (blog_post HAS featured status). This keeps your class structure clean and your instances flexible.",
      "tags": [
        "concepts",
        "advanced"
      ]
    }
  }
}
