{
  "id": "deterministic-builds",
  "class": "blog_post",
  "title": "Deterministic Builds: Same Input, Same Output",
  "slug": "deterministic-builds",
  "description": "Why reproducible builds matter for static sites",
  "$aspects": {
    "blog_post": {
      "date": "2025-12-12",
      "content": "Here's a test: build Skribe twice with the same input. Don't change anything, just run the build command again. Now diff the outputs. What do you find? **They're identical. Byte for byte.** Not 'mostly the same' or 'same except for timestamps'. Exactly the same. This isn't luck or a happy accident—it's determinism by design.\n\nStruktur achieves this through obsessive attention to ordering and stability. Instances are sorted predictably by sourceIndex and then alphabetically by path. Template iterations use sorted arrays. There are no timestamps in generated content, no random values, no filesystem iteration order dependencies. The merge algorithm is stable. The template helpers are pure functions. Everything that could introduce variability has been eliminated or controlled.\n\nYou might be thinking 'so what?' Here's why it matters: **deterministic builds are diffable**. Change one blog post and rebuild. Now you can diff the two builds and see EXACTLY what changed—just that one post file and the pages that reference it (index, tag pages). This makes debugging trivial and code review meaningful. You can see the impact of changes precisely.\n\nDeterminism also means **reproducibility**. Check out a commit from six months ago, rebuild, and you get the exact same output that was deployed then. This is crucial for archival, for debugging production issues, and for regulatory compliance in some industries.\n\nBut the real magic is **trust**. When builds are deterministic, you can trust your toolchain. If it builds successfully in CI, it'll build the same way in production. If it works on your machine, it works on everyone's machine. There's no 'race condition in the build script' or 'weird caching issue' to debug. It just works, reliably, every time.\n\nFor documentation sites, blogs, and content platforms, this reliability is foundational. Your content is your product. Deterministic builds mean you can focus on content quality instead of fighting your toolchain.",
      "tags": [
        "concepts",
        "best-practices"
      ]
    }
  }
}
